module wx.CommandEvent;
public import wx.common;
public import wx.Event;

public import wx.ClientData;

//! \cond EXTERN
extern (C) ЦелУкз wxCommandEvent_ctor(цел тип,цел идок);
extern (C) цел    wxCommandEvent_GetSelection(ЦелУкз сам);
extern (C) ЦелУкз wxCommandEvent_GetString(ЦелУкз сам);
extern (C) проц wxCommandEvent_SetString(ЦелУкз сам, ткст т);
extern (C) бул   wxCommandEvent_IsChecked(ЦелУкз сам);
extern (C) бул   wxCommandEvent_IsSelection(ЦелУкз сам);
extern (C) цел    wxCommandEvent_GetInt(ЦелУкз сам);
extern (C) проц wxCommandEvent_SetInt(ЦелУкз сам, цел i);

extern (C) ЦелУкз wxCommandEvent_GetClientObject(ЦелУкз сам);
extern (C) проц   wxCommandEvent_SetClientObject(ЦелУкз сам, ЦелУкз данные);

extern (C) проц wxCommandEvent_SetExtraLong(ЦелУкз сам, бцел extralong);
extern (C) бцел wxCommandEvent_GetExtraLong(ЦелУкз сам);
//! \endcond

//-----------------------------------------------------------------------------

export class СобытиеКоманды : Событие
{

    export this(ЦелУкз вхобъ)
    {
        super(вхобъ);
    }

    export this(ТипСобытия типКоманды = super.Тип.СОБ_НУЛЛ, цел идок = 0)
    {
        super(wxCommandEvent_ctor(cast(цел) типКоманды,идок));
    }

    //-----------------------------------------------------------------------------

    export цел выбор()
    {
        return wxCommandEvent_GetSelection(this.м_вхобъ);
    }

    //-----------------------------------------------------------------------------

    export ткст вТкст()
    {
        return cast(ткст) new ВизТкст(wxCommandEvent_GetString(this.м_вхобъ), да);
    }
    export проц вТкст(ткст значение)
    {
        wxCommandEvent_SetString(this.м_вхобъ, значение);
    }

    //-----------------------------------------------------------------------------

    export бул отмечен()
    {
        return wxCommandEvent_IsChecked(this.м_вхобъ);
    }

    //-----------------------------------------------------------------------------

    export бул выделение_ли()
    {
        return wxCommandEvent_IsSelection(this.м_вхобъ);
    }

    //-----------------------------------------------------------------------------

    export цел вЦел()
    {
        return wxCommandEvent_GetInt(this.м_вхобъ);
    }
    export проц вЦел(цел значение)
    {
        wxCommandEvent_SetInt(вхобъ, значение);
    }

    //-----------------------------------------------------------------------------

    export ДанныеКлиента объКлиента()
    {
        return cast(ДанныеКлиента)найдиОбъект(wxCommandEvent_GetClientObject(this.м_вхобъ));
    }
    export проц ОбъектКлиент(ДанныеКлиента значение)
    {
        wxCommandEvent_SetClientObject(this.м_вхобъ, ВизОбъект.безопУк(значение));
    }

    //-----------------------------------------------------------------------------

    export цел экстраДол()
    {
        return cast(цел)wxCommandEvent_GetExtraLong(this.м_вхобъ);
    }
    export проц экстраДол(цел значение)
    {
        wxCommandEvent_SetExtraLong(this.м_вхобъ, cast(бцел)значение);
    }

    private static Событие Нов(ЦелУкз объ)
    {
        return new СобытиеКоманды(объ);
    }

    static this()
    {
        добавьТипСоб(super.Тип.СОБ_КОМАНДА_КНОПКА_НАЖАТА,          &СобытиеКоманды.Нов);
        добавьТипСоб(super.Тип.СОБ_КОМАНДА_МЕНЮ_ВЫБРАНО,           &СобытиеКоманды.Нов);

        добавьТипСоб(super.Тип.СОБ_КОМАНДА_ЧЕКБОКС_НАЖАТ,        &СобытиеКоманды.Нов);

        добавьТипСоб(super.Тип.СОБ_КОМАНДА_ЛИСТБОКС_ВЫБРАН,        &СобытиеКоманды.Нов);
        добавьТипСоб(super.Тип.СОБ_КОМАНДА_ЛИСТБОКС_ДВАЖДЫ_НАЖАТ,   &СобытиеКоманды.Нов);
        добавьТипСоб(super.Тип.СОБ_КОМАНДА_ВЫБОР_ВЫБРАН,         &СобытиеКоманды.Нов);
        добавьТипСоб(super.Тип.СОБ_КОМАНДА_КОМБОБОКС_ВЫБРАН,       &СобытиеКоманды.Нов);
        добавьТипСоб(super.Тип.СОБ_КОМАНДА_ТЕКСТ_ОБНОВЛЁН,            &СобытиеКоманды.Нов);
        добавьТипСоб(super.Тип.СОБ_КОМАНДА_ТЕКСТ_ВВОД,              &СобытиеКоманды.Нов);
        добавьТипСоб(super.Тип.СОБ_КОМАНДА_РАДИОБОКС_ВЫБРАН,       &СобытиеКоманды.Нов);
        добавьТипСоб(super.Тип.СОБ_КОМАНДА_РАДИОКНОПКА_ВЫБРАНА,    &СобытиеКоманды.Нов);
        добавьТипСоб(super.Тип.СОБ_КОМАНДА_ПОЛЗУНОК_ОБНОВЛЁН,          &СобытиеКоманды.Нов);
        добавьТипСоб(super.Тип.СОБ_КОМАНДА_СПИНКТРЛ_ОБНОВЛЁН,        &СобытиеКоманды.Нов);

        добавьТипСоб(super.Тип.СОБ_КОМАНДА_ПЕРЕКЛЮЧАТЕЛЬ_НАЖАТ,    &СобытиеКоманды.Нов);

        добавьТипСоб(super.Тип.СОБ_КОМАНДА_ЛИСТБОКС_ТОГГЛ,    &СобытиеКоманды.Нов);
    }
}
