module wx.Dialog;
public import wx.common;
public import wx.Window;

//! \cond EXTERN
extern (C) ЦелУкз wxDialog_ctor();
extern (C) проц   wxDialog_dtor(ЦелУкз сам);

extern (C) проц   wxDialog_SetReturnCode(ЦелУкз сам, цел returnCode);
extern (C) цел    wxDialog_GetReturnCode(ЦелУкз сам);

extern (C) ЦелУкз wxDialog_GetTitle(ЦелУкз сам);
extern (C) проц   wxDialog_SetTitle(ЦелУкз сам, ткст титул);

extern (C) бул   wxDialog_Create(ЦелУкз сам, ЦелУкз родитель, цел ид, ткст титул, inout Точка поз, inout Размер размер, бцел стиль, ткст имя);

extern (C) проц   wxDialog_EndModal(ЦелУкз сам, цел возврКод);

extern (C) бул   wxDialog_IsModal(ЦелУкз сам);
//extern (C) проц   wxDialog_SetModal(ЦелУкз сам, бул modal);

extern (C) проц   wxDialog_SetIcon(ЦелУкз сам, ЦелУкз пиктограмма);
extern (C) проц   wxDialog_SetIcons(ЦелУкз сам, ЦелУкз icons);

extern (C) цел    wxDialog_ShowModal(ЦелУкз сам);
//! \endcond

//---------------------------------------------------------------------

/// A dialog бокс is a окно with a титул bar and sometimes a
/// system меню, который can be moved around the screen. It can contain
/// controls and другой windows and is usually used до разрешить the user
/// до make some choice or до answer a question.
export class Диалог : Окно
{
    enum
    {
        ЦЕНТР		= 0x00000001,
        ДА			= 0x00000002,
        ОК			= 0x00000004,
        НЕТ			= 0x00000008,
        ОТМЕНА		= 0x00000010,
        ДАНЕТ		= (ДА | НЕТ),

        ДЕФДА		= 0x00000000,
        ДЕФНЕТ		= 0x00000080,

        ИКВОСКЛИЦАНИЕ 	= 0x00000100,
        ИКРУКА		= 0x00000200,
        ИКПРЕДУПРЕЖДЕНИЕ	= ИКВОСКЛИЦАНИЕ,
        ИКОШИБКА		= ИКРУКА,
        ИКВОПРОС	= 0x00000400,
        ИКИНФО	= 0x00000800,
        ИКСТОП		= ИКРУКА,
        ИКЗВЕЗДА	= ИКИНФО,
        ИКМАСКА		= (0x00000100|0x00000200|0x00000400|0x00000800),

        ВПЕРЁД		= 0x00001000,
        НАЗАД		= 0x00002000,
        СБРОС		= 0x00004000,
        ПОМОЩЬ		= 0x00008000,
        ЕЩЁ 		= 0x00010000,
        СЕТАП		= 0x00020000,
    }

    //---------------------------------------------------------------------
    const ткст СтрИмениДиалога="dialog";

    export this(ЦелУкз вхобъ)
    {
        super(вхобъ);
    }

    export this()
    {
        super(wxDialog_ctor());
    }

    export this(Окно родитель, цел ид, ткст титул, Точка поз=ДЕФПОЗ, Размер размер=ДЕФРАЗМ, цел стиль=ДЕФ_СТИЛЬ_ДИАЛОГА, ткст имя=СтрИмениДиалога)
    {
        super(wxDialog_ctor());
        if (!создай(родитель, ид, титул, поз, размер, стиль, имя))
        {
            throw new ИсклНевернОперации("Не удалось создать Диалог");
        }
    }

    //---------------------------------------------------------------------
    // ctors with сам created ид

    export this(Окно родитель, ткст титул, Точка поз=ДЕФПОЗ, Размер размер=ДЕФРАЗМ, цел стиль=ДЕФ_СТИЛЬ_ДИАЛОГА, ткст имя=СтрИмениДиалога)
    {
        this(родитель, Окно.уникИд, титул, поз, размер, стиль, имя);
    }

    //---------------------------------------------------------------------

    export бул создай(Окно окно, цел ид, ткст титул, inout Точка поз,
                       inout Размер размер, цел стиль, ткст имя)
    {
        return wxDialog_Create(вхобъ, ВизОбъект.безопУк(окно), ид, титул,
                               поз, размер, cast(бцел)стиль, имя);
    }

    //---------------------------------------------------------------------

    export цел кодВозврата()
    {
        return wxDialog_GetReturnCode(вхобъ);
    }
    export проц кодВозврата(цел значение)
    {
        wxDialog_SetReturnCode(вхобъ, значение);
    }

    //---------------------------------------------------------------------

    export override ткст титул()
    {
        return cast(ткст) new ВизТкст(wxDialog_GetTitle(вхобъ), да);
    }
    export override проц титул(ткст значение)
    {
        wxDialog_SetTitle(вхобъ, значение);
    }

    //---------------------------------------------------------------------

    export проц завершиМодально(цел возврКод)
    {
        wxDialog_EndModal(вхобъ, cast(цел)возврКод);
    }

    //---------------------------------------------------------------------

    export проц устИконку(Пиктограмма пиктограмма)
    {
        wxDialog_SetIcon(вхобъ, ВизОбъект.безопУк(пиктограмма));
    }

    /*export проц УстIcons(IconBundle icons)
    {
    	wxDialog_SetIcons(вхобъ, ВизОбъект.безопУк(icons);
    }*/

    //---------------------------------------------------------------------

    export  цел покажиМодально()
    {
        return wxDialog_ShowModal(вхобъ);
    }

    //---------------------------------------------------------------------

    //deprecated export проц Modal(бул значение) { wxDialog_SetModal(вхобъ, значение); }
    export бул модален()
    {
        return wxDialog_IsModal(вхобъ);
    }
}
