module wx.ImageList;
public import wx.common;
public import wx.Bitmap;
public import wx.DC;

// Flag values for установи/дайСписокРисунков
enum
{
    wxIMAGE_LIST_NORMAL, // Normal icons
    wxIMAGE_LIST_SMALL,  // Small icons
    wxIMAGE_LIST_STATE   // состояние icons: unimplemented (see WIN32 documentation)
}

//---------------------------------------------------------------------

//! \cond EXTERN
extern (C) ЦелУкз wxImageList_ctor(цел ширь, цел высь, бул маска, цел исхСчёт);
extern (C) ЦелУкз wxImageList_ctor2();
extern (C) цел    wxImageList_AddBitmap1(ЦелУкз сам, ЦелУкз бмп, ЦелУкз маска);
extern (C) цел    wxImageList_AddBitmap(ЦелУкз сам, ЦелУкз бмп, ЦелУкз цветМаски);
extern (C) цел    wxImageList_AddIcon(ЦелУкз сам, ЦелУкз пиктограмма);
extern (C) цел    wxImageList_GetImageCount(ЦелУкз сам);

extern (C) бул   wxImageList_Draw(ЦелУкз сам, цел индекс, ЦелУкз ку, цел x, цел y, цел флаги, бул плотныйФон);

extern (C) бул   wxImageList_Create(ЦелУкз сам, цел ширь, цел высь, бул маска, цел исхСчёт);

extern (C) бул   wxImageList_Replace(ЦелУкз сам, цел индекс, ЦелУкз битмап);

extern (C) бул   wxImageList_Remove(ЦелУкз сам, цел индекс);
extern (C) бул   wxImageList_RemoveAll(ЦелУкз сам);

//extern (C) ЦелУкз wxImageList_GetBitmap(ЦелУкз сам, цел индекс);

extern (C) бул   wxImageList_GetSize(ЦелУкз сам, цел индекс, inout цел ширь, inout цел высь);
//! \endcond

//---------------------------------------------------------------------

export class СписокРисунков : ВизОбъект
{
    public const цел ОТРИСОВКА_НОРМАЛЬНО	= 0x0001;
    public const цел ОТРИСОВКА_ПРОЗРАЧНО	= 0x0002;
    public const цел ОТРИСОВКА_ВЫДЕЛЕННО	= 0x0004;
    public const цел ОТРИСОВКА_ФОКУСИРОВАННО	= 0x0008;

    //---------------------------------------------------------------------

    export this(цел ширь, цел высь, бул маска = да, цел исхСчёт=1)
    {
        super(wxImageList_ctor(ширь, высь, маска, исхСчёт));
    }

    export this(ЦелУкз вхобъ)
    {
        super(вхобъ);
    }

    export this()
    {
        super(wxImageList_ctor2());
    }

    export static ВизОбъект Нов(ЦелУкз ptr)
    {
        return new СписокРисунков(ptr);
    }
    //---------------------------------------------------------------------

    export цел добавь(Битмап битмап)
    {
        return wxImageList_AddBitmap1(вхобъ, ВизОбъект.безопУк(битмап), ЦелУкз.init);
    }

    export цел добавь(Битмап битмап, Битмап маска)
    {
        return wxImageList_AddBitmap1(вхобъ, ВизОбъект.безопУк(битмап), ВизОбъект.безопУк(маска));
    }

    export цел добавь(Пиктограмма пиктограмма)
    {
        return wxImageList_AddIcon(вхобъ, ВизОбъект.безопУк(пиктограмма));
    }

    export цел добавь(Битмап бмп, Цвет цветМаски)
    {
        return wxImageList_AddBitmap(вхобъ, ВизОбъект.безопУк(бмп), ВизОбъект.безопУк(цветМаски));
    }

    //---------------------------------------------------------------------

    export бул создай(цел ширь, цел высь)
    {
        return создай(ширь, высь, да, 1);
    }

    export бул создай(цел ширь, цел высь, бул маска)
    {
        return создай(ширь, высь, маска, 1);
    }

    export бул создай(цел ширь, цел высь, бул маска, цел исхСчёт)
    {
        return wxImageList_Create(вхобъ, ширь, высь, маска, исхСчёт);
    }

    //---------------------------------------------------------------------

    export цел члоРисунков()
    {
        return wxImageList_GetImageCount(вхобъ);
    }

    //---------------------------------------------------------------------

    export бул рисуй(цел индекс, КонтекстУстройства ку, цел x, цел y)
    {
        return рисуй(индекс, ку, x, y, ОТРИСОВКА_НОРМАЛЬНО, нет);
    }

    export бул рисуй(цел индекс, КонтекстУстройства ку, цел x, цел y, цел флаги)
    {
        return рисуй(индекс, ку, x, y, флаги, нет);
    }

    export бул рисуй(цел индекс, КонтекстУстройства ку, цел x, цел y, цел флаги, бул плотныйФон)
    {
        return wxImageList_Draw(вхобъ, индекс, ВизОбъект.безопУк(ку), x, y, флаги, плотныйФон);
    }

    //---------------------------------------------------------------------

    export бул замени(цел индекс, Битмап битмап)
    {
        return wxImageList_Replace(вхобъ, индекс, ВизОбъект.безопУк(битмап));
    }

    //---------------------------------------------------------------------

    export бул удали(цел индекс)
    {
        return wxImageList_Remove(вхобъ, индекс);
    }

    //---------------------------------------------------------------------

    export бул удалиВсе()
    {
        return wxImageList_RemoveAll(вхобъ);
    }

    //---------------------------------------------------------------------

    /*export Битмап дайБитмап(цел индекс)
    {
    	return cast(Битмап)найдиОбъект(wxImageList_GetBitmap(вхобъ, индекс), &Битмап.Нов);
    }*/

    //---------------------------------------------------------------------

    export бул дайРазмер(цел индекс, inout цел ширь, inout цел высь)
    {
        return wxImageList_GetSize(вхобъ, индекс, ширь, высь);
    }
}
