module wx.Listbook;
public import wx.common;
public import wx.Control;
public import wx.ImageList;

//! \cond EXTERN
extern (C) ЦелУкз wxListbookEvent_ctor(цел типКоманды, цел ид, цел члоВыб, цел члоСтарВыб);
extern (C) цел    wxListbookEvent_GetSelection(ЦелУкз сам);
extern (C) проц   wxListbookEvent_SetSelection(ЦелУкз сам, цел члоВыб);
extern (C) цел    wxListbookEvent_GetOldSelection(ЦелУкз сам);
extern (C) проц   wxListbookEvent_SetOldSelection(ЦелУкз сам, цел члоСтарВыб);
extern (C) проц wxListbookEvent_Veto(ЦелУкз сам);
extern (C) проц wxListbookEvent_Allow(ЦелУкз сам);
extern (C) бул wxListbookEvent_IsAllowed(ЦелУкз сам);
//! \endcond

//-----------------------------------------------------------------------------

export class СобытиеЛистбука : Событие
{
    export this(ЦелУкз вхобъ)
    {
        super(вхобъ);
    }

    export this(ТипСобытия типКоманды, цел ид, цел члоВыб, цел члоСтарВыб)
    {
        super(wxListbookEvent_ctor(типКоманды, ид, члоВыб, члоСтарВыб));
    }

    static Событие Нов(ЦелУкз ptr)
    {
        return new СобытиеЛистбука(ptr);
    }
    //-----------------------------------------------------------------------------

    export цел выделение()
    {
        return wxListbookEvent_GetSelection(вхобъ);
    }
    export проц выделение(цел значение)
    {
        wxListbookEvent_SetSelection(вхобъ, значение);
    }

    //-----------------------------------------------------------------------------

    export цел старВыделение()
    {
        return wxListbookEvent_GetOldSelection(вхобъ);
    }
    export проц старВыделение(цел значение)
    {
        wxListbookEvent_SetOldSelection(вхобъ, значение);
    }

    //-----------------------------------------------------------------------------

    export проц запрет()
    {
        wxListbookEvent_Veto(вхобъ);
    }

    //-----------------------------------------------------------------------------

    export проц позволить()
    {
        wxListbookEvent_Allow(вхобъ);
    }

    //-----------------------------------------------------------------------------

    export бул позволено()
    {
        return wxListbookEvent_IsAllowed(вхобъ);
    }

    static this()
    {
        Событие.Тип.СОБ_КОМАНДА_СТРАНИЦА_ЛИСТБУКА_ИЗМЕНЕНА = wxEvent_EVT_COMMAND_LISTBOOK_PAGE_CHANGED();
        Событие.Тип.СОБ_КОМАНДА_СТРАНИЦА_ЛИСТБУКА_ИЗМЕНЯЕТСЯ = wxEvent_EVT_COMMAND_LISTBOOK_PAGE_CHANGING();

        добавьТипСоб (Событие.Тип.СОБ_КОМАНДА_СТРАНИЦА_ЛИСТБУКА_ИЗМЕНЕНА, &СобытиеЛистбука.Нов);
        добавьТипСоб (Событие.Тип.СОБ_КОМАНДА_СТРАНИЦА_ЛИСТБУКА_ИЗМЕНЯЕТСЯ, &СобытиеЛистбука.Нов);
    }
}

//-----------------------------------------------------------------------------

//! \cond EXTERN
extern (C) ЦелУкз wxListbook_ctor();
extern (C) бул wxListbook_Create(ЦелУкз сам, ЦелУкз родитель, цел ид, inout Точка поз, inout Размер размер, бцел стиль, ткст имя);
extern (C) цел wxListbook_GetSelection(ЦелУкз сам);
extern (C) бул wxListbook_SetPageText(ЦелУкз сам, цел ч, ткст стрТекст);
extern (C) ЦелУкз wxListbook_GetPageText(ЦелУкз сам, цел ч);
extern (C) цел wxListbook_GetPageImage(ЦелУкз сам, цел ч);
extern (C) бул wxListbook_SetPageImage(ЦелУкз сам, цел ч, цел идРисунка);
extern (C) проц wxListbook_CalcSizeFromPage(ЦелУкз сам, inout Размер стрРазм, out Размер outSize);
extern (C) бул wxListbook_InsertPage(ЦелУкз сам, цел ч, ЦелУкз страница, ткст текст, бул выделить, цел идРисунка);
extern (C) цел wxListbook_SetSelection(ЦелУкз сам, цел ч);
extern (C) проц wxListbook_SetImageList(ЦелУкз сам, ЦелУкз списокРисунков);
extern (C) бул wxListbook_IsVertical(ЦелУкз сам);
extern (C) цел wxListbook_GetPageCount(ЦелУкз сам);
extern (C) ЦелУкз wxListbook_GetPage(ЦелУкз сам, цел ч);
extern (C) проц wxListbook_AssignImageList(ЦелУкз сам, ЦелУкз списокРисунков);
extern (C) ЦелУкз wxListbook_GetImageList(ЦелУкз сам);
extern (C) проц wxListbook_SetPageSize(ЦелУкз сам, inout Размер размер);
extern (C) бул wxListbook_DeletePage(ЦелУкз сам, цел члоСтр);
extern (C) бул wxListbook_RemovePage(ЦелУкз сам, цел члоСтр);
extern (C) бул wxListbook_DeleteAllPages(ЦелУкз сам);
extern (C) бул wxListbook_AddPage(ЦелУкз сам, ЦелУкз страница, ткст текст, бул bselect, цел идРисунка);
extern (C) проц wxListbook_AdvanceSelection(ЦелУкз сам, бул вперёд);
//! \endcond

//-----------------------------------------------------------------------------

export class Листбук : Контрол
{
    public const цел ДЕФОЛТ		= 0;
    public const цел ВЕРХ		= 0x1;
    public const цел НИЗ		= 0x2;
    public const цел ЛЕВО		= 0x4;
    public const цел ПРАВО		= 0x8;
    public const цел РАСКЛАД_ПО_МАСКЕ	= 0xf;

    //-----------------------------------------------------------------------------

    export this(ЦелУкз вхобъ)
    {
        super(вхобъ);
    }

    export this()
    {
        super(wxListbook_ctor());
    }

    export this(Окно родитель, цел ид, Точка поз = ДЕФПОЗ, Размер размер = ДЕФРАЗМ, цел стиль = 0, ткст имя = "")
    {
        super(wxListbook_ctor());
        wxListbook_Create(вхобъ, ВизОбъект.безопУк(родитель), ид, поз, размер, cast(бцел)стиль, имя);
    }

    export static ВизОбъект Нов(ЦелУкз вхобъ)
    {
        return new Листбук(вхобъ);
    }

    //---------------------------------------------------------------------
    // ctors with сам created ид

    export this(Окно родитель, Точка поз = ДЕФПОЗ, Размер размер = ДЕФРАЗМ, цел стиль = 0, ткст имя = "")
    {
        this(родитель, Окно.уникИд, поз, размер, стиль, имя);
    }

    //-----------------------------------------------------------------------------

    export цел выделение()
    {
        return wxListbook_GetSelection(вхобъ);
    }
    export проц выделение(цел значение)
    {
        wxListbook_SetSelection(вхобъ, значение);
    }

    //-----------------------------------------------------------------------------

    export бул устТекстСтраницы(цел ч, ткст стрТекст)
    {
        return wxListbook_SetPageText(вхобъ, ч, стрТекст);
    }

    //-----------------------------------------------------------------------------

    export ткст дайТекстСтраницы(цел ч)
    {
        return cast(ткст) new ВизТкст(wxListbook_GetPageText(вхобъ, ч), да);
    }

    //-----------------------------------------------------------------------------

    export цел дайРисунокСтраницы(цел ч)
    {
        return wxListbook_GetPageImage(вхобъ, ч);
    }

    //-----------------------------------------------------------------------------

    export бул устРисунокСтраницы(цел ч, цел идРисунка)
    {
        return wxListbook_SetPageImage(вхобъ, ч, идРисунка);
    }

    //-----------------------------------------------------------------------------

    export Размер вычислиРазмерИзСтраницы(Размер стрРазм)
    {
        Размер т;
        wxListbook_CalcSizeFromPage(вхобъ, стрРазм, т);
        return т;
    }

    //-----------------------------------------------------------------------------


    export бул вставьСтраницу(цел ч, Окно страница, ткст текст)
    {
        return вставьСтраницу(ч, страница, текст, нет, -1);
    }


    export бул вставьСтраницу(цел ч, Окно страница, ткст текст, бул выделить)
    {
        return вставьСтраницу(ч, страница, текст, выделить, -1);
    }

    export бул вставьСтраницу(цел ч, Окно страница, ткст текст, бул выделить, цел идРисунка)
    {
        return wxListbook_InsertPage(вхобъ, ч, ВизОбъект.безопУк(страница), текст, выделить, идРисунка);
    }

    //-----------------------------------------------------------------------------

    export проц списокРисунков(СписокРисунков значение)
    {
        wxListbook_SetImageList(вхобъ, ВизОбъект.безопУк(значение));
    }
    export СписокРисунков списокРисунков()
    {
        return cast(СписокРисунков)найдиОбъект(wxListbook_GetImageList(вхобъ), &СписокРисунков.Нов);
    }

    //-----------------------------------------------------------------------------

    export бул вертикален()
    {
        return wxListbook_IsVertical(вхобъ);
    }

    //-----------------------------------------------------------------------------

    export цел счётСтраниц()
    {
        return wxListbook_GetPageCount(вхобъ);
    }

    //-----------------------------------------------------------------------------

    export Окно дайСтраницу(цел ч)
    {
        //	return cast(Окно)найдиОбъект(wxListbook_GetPage(вхобъ, ч), &Окно.Нов);
        ЦелУкз ptr = wxListbook_GetPage(вхобъ, ч);
        ВизОбъект o = найдиОбъект(ptr);
        if (o) return cast(Окно)o;
        else return new Окно(ptr);
    }

    //-----------------------------------------------------------------------------

    export проц присвойСписокРисунков(СписокРисунков списокРисунков)
    {
        wxListbook_AssignImageList(вхобъ, ВизОбъект.безопУк(списокРисунков));
    }

    //-----------------------------------------------------------------------------

    export проц размерСтраницы(Размер значение)
    {
        wxListbook_SetPageSize(вхобъ, значение);
    }

    //-----------------------------------------------------------------------------

    export бул удалиСтраницу(цел члоСтр)
    {
        return wxListbook_DeletePage(вхобъ, члоСтр);
    }

    //-----------------------------------------------------------------------------

    export бул удалиСтраницу2(цел члоСтр)
    {
        return wxListbook_RemovePage(вхобъ, члоСтр);
    }

    //-----------------------------------------------------------------------------

    export бул удалиВсеСтраницы()
    {
        return wxListbook_DeleteAllPages(вхобъ);
    }

    //-----------------------------------------------------------------------------

    export бул добавьСтраницу(Окно страница, ткст текст, бул выделить, цел идРисунка)
    {
        return wxListbook_AddPage(вхобъ, ВизОбъект.безопУк(страница), текст, выделить, идРисунка);
    }

    //-----------------------------------------------------------------------------

    export проц продвиньВыделение(бул вперёд)
    {
        wxListbook_AdvanceSelection(вхобъ, вперёд);
    }

    //-----------------------------------------------------------------------------

    export проц PageChange_Add(ДатчикСобытий значение)
    {
        добавьДатчикКоманд(Событие.Тип.СОБ_КОМАНДА_СТРАНИЦА_ЛИСТБУКА_ИЗМЕНЕНА, ид, значение, this);
    }
    export проц PageChange_Remove(ДатчикСобытий значение)
    {
        удалиОбработчик(значение, this);
    }

    export проц PageChanging_Add(ДатчикСобытий значение)
    {
        добавьДатчикКоманд(Событие.Тип.СОБ_КОМАНДА_СТРАНИЦА_ЛИСТБУКА_ИЗМЕНЯЕТСЯ, ид, значение, this);
    }
    export проц PageChanging_Remove(ДатчикСобытий значение)
    {
        удалиОбработчик(значение, this);
    }
}

