module wx.MenuBar;
public import wx.common;
public import wx.EvtHandler;
public import wx.Menu;

//! \cond EXTERN
extern (C) ЦелУкз wxMenuBar_ctor();
extern (C) ЦелУкз wxMenuBar_ctor2(бцел стиль);
extern (C) бул   wxMenuBar_Append(ЦелУкз сам, ЦелУкз меню, ткст титул);
extern (C) проц   wxMenuBar_Check(ЦелУкз сам, цел ид, бул чекать);
extern (C) бул   wxMenuBar_IsChecked(ЦелУкз сам, цел ид);
extern (C) бул   wxMenuBar_Insert(ЦелУкз сам, цел поз, ЦелУкз меню, ткст титул);
extern (C) ЦелУкз wxMenuBar_FindItem(ЦелУкз сам, цел ид, inout ЦелУкз меню);

extern (C) цел    wxMenuBar_GetMenuCount(ЦелУкз сам);
extern (C) ЦелУкз wxMenuBar_GetMenu(ЦелУкз сам, цел поз);

extern (C) ЦелУкз wxMenuBar_Replace(ЦелУкз сам, цел поз, ЦелУкз меню, ткст титул);
extern (C) ЦелУкз wxMenuBar_Remove(ЦелУкз сам, цел поз);

extern (C) проц   wxMenuBar_EnableTop(ЦелУкз сам, цел поз, бул вкл);

extern (C) проц   wxMenuBar_Enable(ЦелУкз сам, цел ид, бул вкл);

extern (C) цел    wxMenuBar_FindMenu(ЦелУкз сам, ткст титул);
extern (C) цел    wxMenuBar_FindMenuItem(ЦелУкз сам, ткст ткстМеню, ткст ткстЭлта);

extern (C) ЦелУкз wxMenuBar_GetHelpString(ЦелУкз сам, цел ид);
extern (C) ЦелУкз wxMenuBar_GetLabel(ЦелУкз сам, цел ид);
extern (C) ЦелУкз wxMenuBar_GetLabelTop(ЦелУкз сам, цел поз);

extern (C) бул   wxMenuBar_IsEnabled(ЦелУкз сам, цел ид);

extern (C) проц   wxMenuBar_Refresh(ЦелУкз сам);

extern (C) проц   wxMenuBar_SetHelpString(ЦелУкз сам, цел ид, ткст ткстСправки);
extern (C) проц   wxMenuBar_SetLabel(ЦелУкз сам, цел ид, ткст ярлык);
extern (C) проц   wxMenuBar_SetLabelTop(ЦелУкз сам, цел поз, ткст ярлык);
//! \endcond

export class МенюБар : ОбработчикСоб
{
    //---------------------------------------------------------------------

    export this()
    {
        this(wxMenuBar_ctor());
    }

    export this(цел стиль)
    {
        this(wxMenuBar_ctor2(cast(бцел)стиль));
    }

    export this(ЦелУкз вхобъ)
    {
        super(вхобъ);
    }

    export static ВизОбъект Нов(ЦелУкз вхобъ)
    {
        return new МенюБар(вхобъ);
    }

    //---------------------------------------------------------------------

    export бул добавь(Меню меню, ткст титул)
    {
        return wxMenuBar_Append(вхобъ, меню.вхобъ, титул);
    }

    //---------------------------------------------------------------------

    export проц отметь(цел ид, бул чекать)
    {
        wxMenuBar_Check(вхобъ, ид, чекать);
    }

    //---------------------------------------------------------------------

    export бул отмечен(цел ид)
    {
        return wxMenuBar_IsChecked(вхобъ, ид);
    }

    export бул вставь(цел поз, Меню меню, ткст титул)
    {
        return wxMenuBar_Insert(вхобъ, поз, ВизОбъект.безопУк(меню), титул);
    }

    //-----------------------------------------------------------------------------

    export ЭлтМеню найдиЭлт(цел ид)
    {
        Меню меню = пусто;
        return найдиЭлт(ид, меню);
    }

    export ЭлтМеню найдиЭлт(цел ид, inout Меню меню)
    {
        ЦелУкз menuRef = ЦелУкз.init;
        if (меню)
        {
            menuRef = ВизОбъект.безопУк(меню);
        }

        return cast(ЭлтМеню)найдиОбъект(wxMenuBar_FindItem(вхобъ, ид, menuRef), &ЭлтМеню.Нов2);
    }

    //-----------------------------------------------------------------------------

    export цел счётМеню()
    {
        return wxMenuBar_GetMenuCount(вхобъ);
    }

    //-----------------------------------------------------------------------------

    export Меню дайМеню(цел поз)
    {
        return cast(Меню)найдиОбъект(wxMenuBar_GetMenu(вхобъ, поз), &Меню.Нов);
    }

    //-----------------------------------------------------------------------------

    export Меню замени(цел поз, Меню меню, ткст титул)
    {
        return cast(Меню)найдиОбъект(wxMenuBar_Replace(вхобъ, поз, ВизОбъект.безопУк(меню), титул), &Меню.Нов);
    }

    //-----------------------------------------------------------------------------

    export Меню удали(цел поз)
    {
        return cast(Меню)найдиОбъект(wxMenuBar_Remove(вхобъ, поз), &Меню.Нов);
    }

    //-----------------------------------------------------------------------------

    export проц активируйТоп(цел поз, бул вкл)
    {
        wxMenuBar_EnableTop(вхобъ, поз, вкл);
    }

    //-----------------------------------------------------------------------------

    export проц включи(цел ид, бул вкл)
    {
        wxMenuBar_Enable(вхобъ, ид, вкл);
    }

    //-----------------------------------------------------------------------------

    export цел найдиМеню(ткст титул)
    {
        return wxMenuBar_FindMenu(вхобъ, титул);
    }

    //-----------------------------------------------------------------------------

    export цел найдиЭлтМеню(ткст ткстМеню, ткст ткстЭлта)
    {
        return wxMenuBar_FindMenuItem(вхобъ, ткстМеню, ткстЭлта);
    }

    //-----------------------------------------------------------------------------

    export ткст дайТкстСправки(цел ид)
    {
        return cast(ткст) new ВизТкст(wxMenuBar_GetHelpString(вхобъ, ид), да);
    }

    //-----------------------------------------------------------------------------

    export ткст дайЯрлык(цел ид)
    {
        return cast(ткст) new ВизТкст(wxMenuBar_GetLabel(вхобъ, ид), да);
    }

    //-----------------------------------------------------------------------------

    export ткст дайТопЯрлыка(цел поз)
    {
        return cast(ткст) new ВизТкст(wxMenuBar_GetLabelTop(вхобъ, поз), да);
    }

    //-----------------------------------------------------------------------------

    export бул активирован(цел ид)
    {
        return wxMenuBar_IsEnabled(вхобъ, ид);
    }

    //-----------------------------------------------------------------------------

    export проц освежи()
    {
        wxMenuBar_Refresh(вхобъ);
    }

    //-----------------------------------------------------------------------------

    export проц устТкстСправки(цел ид, ткст ткстСправки)
    {
        wxMenuBar_SetHelpString(вхобъ, ид, ткстСправки);
    }

    //-----------------------------------------------------------------------------

    export проц устЯрлык(цел ид, ткст ярлык)
    {
        wxMenuBar_SetLabel(вхобъ, ид, ярлык);
    }

    //-----------------------------------------------------------------------------

    export проц устТопЯрлыка(цел поз, ткст ярлык)
    {
        wxMenuBar_SetLabelTop(вхобъ, поз, ярлык);
    }
}
