module wx.ScrolledWindow;
public import wx.common;
public import wx.Panel;

//! \cond EXTERN
extern (C) ЦелУкз wxScrollWnd_ctor(ЦелУкз родитель, цел ид, inout Точка поз, inout Размер размер, бцел стиль, ткст имя);
extern (C) проц   wxScrollWnd_PrepareDC(ЦелУкз сам, ЦелУкз ку);
extern (C) проц   wxScrollWnd_SetScrollbars(ЦелУкз сам, цел pixX, цел pixY, цел numX, цел numY, цел x, цел y, бул неОсвежать);
extern (C) проц   wxScrollWnd_GetViewStart(ЦелУкз сам, inout цел x, inout цел y);
extern (C) проц   wxScrollWnd_GetScrollPixelsPerUnit(ЦелУкз сам, inout цел хЕдц, inout цел уЕдц);

extern (C) проц   wxScrollWnd_CalcScrolledPosition(ЦелУкз сам, цел x, цел y, inout цел xx, inout цел yy);
extern (C) проц   wxScrollWnd_CalcUnscrolledPosition(ЦелУкз сам, цел x, цел y, inout цел xx, inout цел yy);
extern (C) проц   wxScrollWnd_GetVirtualSize(ЦелУкз сам, inout цел x, inout цел y);
extern (C) проц   wxScrollWnd_Scroll(ЦелУкз сам, цел x, цел y);
extern (C) проц   wxScrollWnd_SetScrollRate(ЦелУкз сам, цел xstep, цел ystep);
extern (C) проц   wxScrollWnd_SetTargetWindow(ЦелУкз сам, ЦелУкз окно);
//! \endcond

//---------------------------------------------------------------------

export class ОкноСПрокруткой : Панель
{
    enum
    {
        СтильОкнаСПрокруткой = (ГПРОКРУТ | ВПРОКРУТ),
    }

    export this(ЦелУкз вхобъ)
    {
        super(вхобъ);
    }

    export this(Окно родитель, цел ид /*= ЛЮБОЙ*/, Точка поз = ДЕФПОЗ, Размер размер = ДЕФРАЗМ, цел стиль = СтильОкнаСПрокруткой, ткст имя = СтрИмениПанели)
    {
        super(wxScrollWnd_ctor(ВизОбъект.безопУк(родитель), ид, поз, размер, стиль, имя));
        собРисование(&приОтрисовке);
    }

    export this(Окно родитель, Точка поз = ДЕФПОЗ, Размер размер = ДЕФРАЗМ, цел стиль = СтильОкнаСПрокруткой, ткст имя = СтрИмениПанели)
    {
        this(родитель,Окно.уникИд,поз,размер,стиль,имя);
    }

    //---------------------------------------------------------------------

    export  проц приПеретяге(КонтекстУстройства ку)
    {
    }

    //---------------------------------------------------------------------

    export override проц подготовьКУ(КонтекстУстройства ку)
    {
        wxScrollWnd_PrepareDC(вхобъ, ку.вхобъ);
    }

    //---------------------------------------------------------------------

    export проц устСкроллбары(цел пикселейНаЕдцуХ, цел пикселейНаЕдцуУ, цел безЕдцХ, цел безЕдцУ)
    {
        устСкроллбары(пикселейНаЕдцуУ, пикселейНаЕдцуУ, безЕдцУ, безЕдцУ, 0, 0, нет);
    }

    export проц устСкроллбары(цел пикселейНаЕдцуХ, цел пикселейНаЕдцуУ, цел безЕдцХ, цел безЕдцУ, цел x, цел y)
    {
        устСкроллбары(пикселейНаЕдцуУ, пикселейНаЕдцуУ, безЕдцУ, безЕдцУ, x, y, нет);
    }

    export проц устСкроллбары(цел пикселейНаЕдцуХ, цел пикселейНаЕдцуУ, цел безЕдцХ, цел безЕдцУ, цел x, цел y, бул неОсвежать)
    {
        wxScrollWnd_SetScrollbars(вхобъ, пикселейНаЕдцуХ, пикселейНаЕдцуУ, безЕдцХ, безЕдцУ, x, y, неОсвежать);
    }

    //---------------------------------------------------------------------

    private проц приОтрисовке(Объект отправитель, Событие e)
    {
        КУРисования ку = new КУРисования(this);
        подготовьКУ(ку);
        приПеретяге(ку);
        ку.вымести();
    }

    //---------------------------------------------------------------------

    export Точка стартОбзора()
    {
        Точка тчк;
        дайСтартОбзора(тчк.Х, тчк.У);
        return тчк;
    }

    export проц дайСтартОбзора(inout цел x, inout цел y)
    {
        wxScrollWnd_GetViewStart(вхобъ, x, y);
    }

    //---------------------------------------------------------------------

    export проц дайПикселиПрокруткиНаЕдиницу(inout цел хЕдц, inout цел уЕдц)
    {
        wxScrollWnd_GetScrollPixelsPerUnit(вхобъ, хЕдц, уЕдц);
    }

    //---------------------------------------------------------------------

    export проц вычислиПрокрПозицию(цел x, цел y, inout цел xx, inout цел yy)
    {
        wxScrollWnd_CalcScrolledPosition(вхобъ, x, y, xx, yy);
    }

    //---------------------------------------------------------------------

    export проц вычислиНепрокрПозицию(цел x, цел y, inout цел xx, inout цел yy)
    {
        wxScrollWnd_CalcUnscrolledPosition(вхобъ, x, y, xx, yy);
    }

    //---------------------------------------------------------------------

    export проц дайВиртРазм(inout цел x, inout цел y)
    {
        wxScrollWnd_GetVirtualSize(вхобъ, x, y);
    }

    //---------------------------------------------------------------------

    export проц промотай(цел x, цел y)
    {
        wxScrollWnd_Scroll(вхобъ, x, y);
    }

    //---------------------------------------------------------------------

    export проц устрРейтПрокрутки(цел xstep, цел ystep)
    {
        wxScrollWnd_SetScrollRate(вхобъ, xstep, ystep);
    }

    //---------------------------------------------------------------------

    export проц целевоеОкно(Окно значение)
    {
        wxScrollWnd_SetTargetWindow(вхобъ, ВизОбъект.безопУк(значение));
    }
}
