module wx.SpinButton;
public import wx.common;
public import wx.CommandEvent;
public import wx.Control;

//! \cond EXTERN
extern (C) ЦелУкз wxSpinEvent_ctor(цел типКоманды, цел ид);
extern (C) цел wxSpinEvent_GetPosition(ЦелУкз сам);
extern (C) проц wxSpinEvent_SetPosition(ЦелУкз сам, цел поз);
extern (C) проц wxSpinEvent_Veto(ЦелУкз сам);
extern (C) проц wxSpinEvent_Allow(ЦелУкз сам);
extern (C) бул wxSpinEvent_IsAllowed(ЦелУкз сам);
//! \endcond

//-----------------------------------------------------------------------------

export class СобытиеСпина : СобытиеКоманды
{
    export this(ЦелУкз вхобъ)
    {
        super(вхобъ);
    }

    export this(цел типКоманды, цел ид)
    {
        super(wxSpinEvent_ctor(типКоманды, ид));
    }

    //-----------------------------------------------------------------------------

    export цел позиция()
    {
        return wxSpinEvent_GetPosition(вхобъ);
    }
    export проц позиция(цел значение)
    {
        wxSpinEvent_SetPosition(вхобъ, значение);
    }

    //-----------------------------------------------------------------------------

    export проц запрет()
    {
        wxSpinEvent_Veto(вхобъ);
    }

    //-----------------------------------------------------------------------------

    export проц позволить()
    {
        wxSpinEvent_Allow(вхобъ);
    }

    //-----------------------------------------------------------------------------

    export бул позволено()
    {
        return wxSpinEvent_IsAllowed(вхобъ);
    }

    private static Событие Нов(ЦелУкз объ)
    {
        return new СобытиеСпина(объ);
    }

    static this()
    {
        добавьТипСоб(super.Тип.СОБ_СКРОЛЛ_ТУМБТРЭК,               &СобытиеСпина.Нов);
        добавьТипСоб(super.Тип.СОБ_СКРОЛЛ_СТРОКОЙ_ВЫШЕ,                   &СобытиеСпина.Нов);
        добавьТипСоб(super.Тип.СОБ_СКРОЛЛ_СТРОКОЙ_НИЖЕ,                 &СобытиеСпина.Нов);
    }
}

//-----------------------------------------------------------------------------

//! \cond EXTERN
extern (C) ЦелУкз wxSpinButton_ctor();
extern (C) бул   wxSpinButton_Create(ЦелУкз сам, ЦелУкз родитель, цел ид, inout Точка поз, inout Размер размер, бцел стиль, ткст имя);
extern (C) цел    wxSpinButton_GetValue(ЦелУкз сам);
extern (C) цел    wxSpinButton_GetMin(ЦелУкз сам);
extern (C) цел    wxSpinButton_GetMax(ЦелУкз сам);
extern (C) проц   wxSpinButton_SetValue(ЦелУкз сам, цел знач);
extern (C) проц   wxSpinButton_SetRange(ЦелУкз сам, цел minVal, цел maxVal);
//! \endcond

//---------------------------------------------------------------------
export class СпинКнопка : Контрол
{
    // These are duplicated in СпинКтрл.cs (for easier access)
    enum
    {
        ГОРИЗОНТАЛЬНАЯ       = ПОриентация.Горизонталь,
        ВЕРТИКАЛЬНАЯ         = ПОриентация.Вертикаль,
        КЛЮЧИ_СТРЕЛКИ       = 0x1000,
        РЭП             = 0x2000,
    }

    public const ткст СтрИмениСпинКнопки = "СпинКнопка";
    //---------------------------------------------------------------------


    export this(ЦелУкз вхобъ)
    {
        super(вхобъ);
    }

    export this()
    {
        super(wxSpinButton_ctor());
    }

    export this(Окно родитель, цел ид /*= ЛЮБОЙ*/, Точка поз = ДЕФПОЗ, Размер размер = ДЕФРАЗМ, цел стиль = ВЕРТИКАЛЬНАЯ | КЛЮЧИ_СТРЕЛКИ, ткст имя = СтрИмениСпинКнопки)
    {
        super(wxSpinButton_ctor());
        if(!создай(родитель, ид, поз, размер, стиль, имя))
        {
            throw new ИсклНевернОперации("Не удалось создать СпинКнопку");
        }
    }

    export static ВизОбъект Нов(ЦелУкз вхобъ)
    {
        return new СпинКнопка(вхобъ);
    }

    //---------------------------------------------------------------------
    // ctors with сам created ид

    export this(Окно родитель, Точка поз = ДЕФПОЗ, Размер размер = ДЕФРАЗМ, цел стиль = ВЕРТИКАЛЬНАЯ | КЛЮЧИ_СТРЕЛКИ, ткст имя = СтрИмениСпинКнопки)
    {
        this(родитель, Окно.уникИд, поз, размер, стиль, имя);
    }

    //---------------------------------------------------------------------

    export бул создай(Окно родитель, цел ид, inout Точка поз, inout Размер размер,  цел стиль, ткст имя)
    {
        return wxSpinButton_Create(вхобъ, ВизОбъект.безопУк(родитель), ид,
                                   поз, размер, cast(бцел)стиль, имя);
    }

    //---------------------------------------------------------------------

    export цел значение()
    {
        return wxSpinButton_GetValue(вхобъ);
    }
    export проц значение(цел значение)
    {
        wxSpinButton_SetValue(вхобъ, значение);
    }

    //---------------------------------------------------------------------

    export цел макс()
    {
        return wxSpinButton_GetMax(вхобъ);
    }

    export цел мин()
    {
        return wxSpinButton_GetMin(вхобъ);
    }

    export проц устДиапазон(цел мин, цел макс)
    {
        wxSpinButton_SetRange(вхобъ, мин, макс);
    }
}
