
module wx.SplashScreen;
public import wx.common;
public import wx.Frame;

//! \cond EXTERN
extern (C) ЦелУкз wxSplashScreen_ctor(ЦелУкз битмап, бцел стильСплэш, цел миллисек, ЦелУкз родитель, цел ид, inout Точка поз, inout Размер размер, бцел стиль);
extern (C) цел    wxSplashScreen_GetSplashStyle(ЦелУкз сам);
extern (C) ЦелУкз wxSplashScreen_GetSplashWindow(ЦелУкз сам);
extern (C) цел    wxSplashScreen_GetTimeout(ЦелУкз сам);
//! \endcond

//-----------------------------------------------------------------------------

export class СплэшСкрин : Рамка
{
    enum
    {
        ЦЕНТР_НА_РОДИТЕЛЕ   = 0x01,
        ЦЕНТР_НА_ЭКРАНЕ   = 0x02,
        ЦЕНТРА_НЕТ          = 0x00,
        ТАЙМАУТ            = 0x04,
        ТАЙМАУТА_НЕТ         = 0x00,

        ДЕФ_СПЛЭШ =  ПРОСТОЙ_БОРДЮР | РАМКА_БЕЗ_ТАСКБАРА | ОСТАВАТЬСЯ_ВВЕРХУ,
    }

    //-----------------------------------------------------------------------------

    export this(ЦелУкз вхобъ)
    {
        super(вхобъ);
    }

    export this(Битмап битмап, цел стильСплэш, цел миллисек, Окно родитель, цел ид, Точка поз=ДЕФПОЗ, Размер размер=ДЕФРАЗМ, цел стиль=ДЕФ_СПЛЭШ)
    {
        super(wxSplashScreen_ctor(ВизОбъект.безопУк(битмап), стильСплэш, миллисек, ВизОбъект.безопУк(родитель), ид, поз, размер, стиль));
    }

    //-----------------------------------------------------------------------------

    export цел стильСплэш()
    {
        return wxSplashScreen_GetSplashStyle(вхобъ);
    }

    //-----------------------------------------------------------------------------

    export ОкноСплэшСкрина окноСплэш()
    {
        return cast(ОкноСплэшСкрина)найдиОбъект(wxSplashScreen_GetSplashWindow(вхобъ), &ОкноСплэшСкрина.Нов);
    }

    //-----------------------------------------------------------------------------

    export цел таймаут()
    {
        return wxSplashScreen_GetTimeout(вхобъ);
    }
}

//-----------------------------------------------------------------------------

//! \cond EXTERN
extern (C) ЦелУкз wxSplashScreenWindow_ctor(ЦелУкз битмап, ЦелУкз родитель, цел ид, inout Точка поз, inout Размер размер, бцел стиль);
extern (C) проц   wxSplashScreenWindow_SetBitmap(ЦелУкз сам, ЦелУкз битмап);
extern (C) ЦелУкз wxSplashScreenWindow_GetBitmap(ЦелУкз сам);
//! \endcond

//-----------------------------------------------------------------------------

export class ОкноСплэшСкрина : Окно
{
    export this(ЦелУкз вхобъ)
    {
        super(вхобъ);
    }

    export this(Битмап битмап, Окно родитель, цел ид, Точка поз=ДЕФПОЗ, Размер размер=ДЕФРАЗМ, цел стиль=БЕЗ_БОРДЮРА)
    {
        super(wxSplashScreenWindow_ctor(ВизОбъект.безопУк(битмап), ВизОбъект.безопУк(родитель), ид, поз, размер, стиль));
    }

    //-----------------------------------------------------------------------------

    export проц битмап(Битмап значение)
    {
        wxSplashScreenWindow_SetBitmap(вхобъ, ВизОбъект.безопУк(значение));
    }
    export Битмап битмап()
    {
        return cast(Битмап)найдиОбъект(wxSplashScreenWindow_GetBitmap(вхобъ));
    }
}

