module wx.TabCtrl;

//! \cond VERSION
version(none)
{
//! \endcond

    public import wx.common;
    public import wx.Event;
    public import wx.Control;
    public import wx.ImageList;
    public import wx.VizString;

    //! \cond EXTERN
    extern (C) ЦелУкз wxTabEvent_ctor(цел типКоманды, цел ид, цел члоВыб, цел члоСтарВыб);
    extern (C) цел    wxTabEvent_GetSelection(ЦелУкз сам);
    extern (C) проц   wxTabEvent_SetSelection(ЦелУкз сам, цел члоВыб);
    extern (C) цел    wxTabEvent_GetOldSelection(ЦелУкз сам);
    extern (C) проц   wxTabEvent_SetOldSelection(ЦелУкз сам, цел члоСтарВыб);
    extern (C) проц wxTabEvent_Veto(ЦелУкз сам);
    extern (C) проц wxTabEvent_Allow(ЦелУкз сам);
    extern (C) бул wxTabEvent_IsAllowed(ЦелУкз сам);
    //! \endcond

    //-----------------------------------------------------------------------------

    export class СобытиеВкладки : Событие
    {
        export this(ЦелУкз вхобъ)
        {
            super(вхобъ);
        }

        export this(цел типКоманды, цел ид, цел члоВыб, цел члоСтарВыб)
        {
            super(wxTabEvent_ctor(типКоманды, ид, члоВыб, члоСтарВыб));
        }

        //-----------------------------------------------------------------------------

        export цел выделение()
        {
            return wxTabEvent_GetSelection(вхобъ);
        }
        export проц выделение(цел значение)
        {
            wxTabEvent_SetSelection(вхобъ, значение);
        }

        //-----------------------------------------------------------------------------

        export цел старВыделение()
        {
            return wxTabEvent_GetOldSelection(вхобъ);
        }
        export проц старВыделение(цел значение)
        {
            wxTabEvent_SetOldSelection(вхобъ, значение);
        }

        //-----------------------------------------------------------------------------

        export проц запрет()
        {
            wxTabEvent_Veto(вхобъ);
        }

        //-----------------------------------------------------------------------------

        export проц позволить()
        {
            wxTabEvent_Allow(вхобъ);
        }

        //-----------------------------------------------------------------------------

        export бул позволено()
        {
            return wxTabEvent_IsAllowed(вхобъ);
        }

        private static Событие Нов(ЦелУкз объ)
        {
            return new СобытиеВкладки(объ);
        }

        static this()
        {
            СОБ_КОМАНДА_ВКЛАДКА_ВЫД_ИЗМЕНЕНО = wxEvent_EVT_COMMAND_TAB_SEL_CHANGED();
            СОБ_КОМАНДА_ВКЛАДКА_ВЫД_ИЗМЕНЯЕТСЯ = wxEvent_EVT_COMMAND_TAB_SEL_CHANGING();

            добавьТипСоб(СОБ_КОМАНДА_ВКЛАДКА_ВЫД_ИЗМЕНЕНО,   &СобытиеВкладки.Нов);
            добавьТипСоб(СОБ_КОМАНДА_ВКЛАДКА_ВЫД_ИЗМЕНЯЕТСЯ,  &СобытиеВкладки.Нов);
        }
    }

    //-----------------------------------------------------------------------------

    //! \cond EXTERN
    extern (C) ЦелУкз wxTabCtrl_ctor();
    extern (C) ЦелУкз wxTabCtrl_ctor2(ЦелУкз родитель, цел ид, inout Точка поз, inout Размер размер, бцел стиль, ткст имя);
    extern (C) цел wxTabCtrl_GetSelection(ЦелУкз сам);
    extern (C) цел wxTabCtrl_GetCurFocus(ЦелУкз сам);
    extern (C) ЦелУкз wxTabCtrl_GetImageList(ЦелУкз сам);
    extern (C) цел wxTabCtrl_GetItemCount(ЦелУкз сам);
    extern (C) бул wxTabCtrl_GetItemRect(ЦелУкз сам, цел элт, out Прямоугольник прям);
    extern (C) цел wxTabCtrl_GetRowCount(ЦелУкз сам);
    extern (C) ЦелУкз wxTabCtrl_GetItemText(ЦелУкз сам, цел элт);
    extern (C) цел wxTabCtrl_GetItemImage(ЦелУкз сам, цел элт);
    extern (C) ЦелУкз wxTabCtrl_GetItemData(ЦелУкз сам, цел элт);
    extern (C) цел wxTabCtrl_SetSelection(ЦелУкз сам, цел элт);
    extern (C) проц wxTabCtrl_SetImageList(ЦелУкз сам, ЦелУкз списокРисунков);
    extern (C) бул wxTabCtrl_SetItemText(ЦелУкз сам, цел элт, ткст текст);
    extern (C) бул wxTabCtrl_SetItemImage(ЦелУкз сам, цел элт, цел рисунок);
    extern (C) бул wxTabCtrl_SetItemData(ЦелУкз сам, цел элт, ЦелУкз данные);
    extern (C) проц wxTabCtrl_SetItemSize(ЦелУкз сам, inout Размер размер);
    extern (C) бул wxTabCtrl_Create(ЦелУкз сам, ЦелУкз родитель, цел ид, inout Точка поз, inout Размер размер, бцел стиль, ткст имя);
    extern (C) проц wxTabCtrl_SetPadding(ЦелУкз сам, inout Размер padding);
    extern (C) бул wxTabCtrl_DeleteAllItems(ЦелУкз сам);
    extern (C) бул wxTabCtrl_DeleteItem(ЦелУкз сам, цел элт);
    extern (C) цел wxTabCtrl_HitTest(ЦелУкз сам, inout Точка тчк, out цел флаги);
    extern (C) бул wxTabCtrl_InsertItem(ЦелУкз сам, цел элт, ткст текст, цел идРисунка, ЦелУкз данные);
    //! \endcond

    export class ВкладкаКтрл : Контрол
    {
        //-----------------------------------------------------------------------------

        export this(ЦелУкз вхобъ)
        {
            super(вхобъ);
        }

        export this()
        {
            super(wxTabCtrl_ctor());
        }

        export this(Окно родитель, цел ид, Точка поз = ДЕФПОЗ, Размер размер = ДЕФРАЗМ, цел стиль =0, ткст имя = "tabCtrl")
        {
            super(wxTabCtrl_ctor2(ВизОбъект.безопУк(родитель), ид, поз, размер, cast(бцел)стиль, имя));
        }

        export static ВизОбъект Нов(ЦелУкз вхобъ)
        {
            return new ВкладкаКтрл(вхобъ);
        }

        //---------------------------------------------------------------------
        // ctors with сам created ид

        export this(Окно родитель, Точка поз = ДЕФПОЗ, Размер размер = ДЕФРАЗМ, цел стиль =0, ткст имя = "tabCtrl")
        {
            this(родитель, Окно.уникИд, поз, размер, стиль, имя);
        }

        //-----------------------------------------------------------------------------

        export бул создай(Окно родитель, цел ид, inout Точка поз, inout Размер размер, цел стиль, ткст имя)
        {
            return wxTabCtrl_Create(вхобъ, ВизОбъект.безопУк(родитель), ид, поз, размер, cast(бцел)стиль, имя);
        }

        //-----------------------------------------------------------------------------

        export цел выделение()
        {
            return wxTabCtrl_GetSelection(вхобъ);
        }
        export проц выделение(цел значение)
        {
            wxTabCtrl_SetSelection(вхобъ, значение);
        }

        //-----------------------------------------------------------------------------

        export цел курФокус()
        {
            return wxTabCtrl_GetCurFocus(вхобъ);
        }

        //-----------------------------------------------------------------------------

        export СписокРисунков списокРисунков()
        {
            return cast(СписокРисунков)найдиОбъект(wxTabCtrl_GetImageList(вхобъ));
        }
        export проц списокРисунков(СписокРисунков значение)
        {
            wxTabCtrl_SetImageList(вхобъ, ВизОбъект.безопУк(значение));
        }

        //-----------------------------------------------------------------------------

        export цел счётЭлтов()
        {
            return wxTabCtrl_GetItemCount(вхобъ);
        }

        //-----------------------------------------------------------------------------

        export бул дайПрямЭлта(цел элт, out Прямоугольник прям)
        {
            return wxTabCtrl_GetItemRect(вхобъ, элт, прям);
        }

        //-----------------------------------------------------------------------------

        export цел счётРядов()
        {
            return wxTabCtrl_GetRowCount(вхобъ);
        }

        //-----------------------------------------------------------------------------

        export ткст дайТекстЭлта(цел элт)
        {
            ВизТкст текст = new ВизТкст(wxTabCtrl_GetItemText(вхобъ, элт));
            return текст.вТкст();
        }

        //-----------------------------------------------------------------------------

        export цел дайРисунокЭлта(цел элт)
        {
            return wxTabCtrl_GetItemImage(вхобъ, элт);
        }

        //-----------------------------------------------------------------------------

        export ЦелУкз дайДанныеЭлта(цел элт)
        {
            return wxTabCtrl_GetItemData(вхобъ, элт);
        }

        //-----------------------------------------------------------------------------

        export бул устТекстЭлта(цел элт, ткст текст)
        {
            return wxTabCtrl_SetItemText(вхобъ, элт, текст);
        }

        //-----------------------------------------------------------------------------

        export бул устРисунокЭлта(цел элт, цел рисунок)
        {
            return wxTabCtrl_SetItemImage(вхобъ, элт, рисунок);
        }

        //-----------------------------------------------------------------------------

        export бул устДанныеЭлта(цел элт, ЦелУкз данные)
        {
            return wxTabCtrl_SetItemData(вхобъ, элт, данные);
        }

        //-----------------------------------------------------------------------------

        export проц размЭлта(Размер значение)
        {
            wxTabCtrl_SetItemSize(вхобъ, значение);
        }

        //-----------------------------------------------------------------------------

        export проц паддинг(Размер значение)
        {
            wxTabCtrl_SetPadding(вхобъ, значение);
        }

        //-----------------------------------------------------------------------------

        export бул удалиВсеЭлты()
        {
            return wxTabCtrl_DeleteAllItems(вхобъ);
        }

        //-----------------------------------------------------------------------------

        export бул удалиЭлт(цел элт)
        {
            return wxTabCtrl_DeleteItem(вхобъ, элт);
        }

        //-----------------------------------------------------------------------------

        export цел тестНажатия(Точка тчк, out цел флаги)
        {
            return wxTabCtrl_HitTest(вхобъ, тчк, флаги);
        }

        //-----------------------------------------------------------------------------

        export бул вставьЭлт(цел элт, ткст текст)
        {
            return вставьЭлт(элт, текст, -1, ЦелУкз.init);
        }

        export бул вставьЭлт(цел элт, ткст текст, цел идРисунка)
        {
            return вставьЭлт(элт, текст, идРисунка, ЦелУкз.init);
        }

        export бул вставьЭлт(цел элт, ткст текст, цел идРисунка, ЦелУкз данные)
        {
            return wxTabCtrl_InsertItem(вхобъ, элт, текст, идРисунка, данные);
        }

        //---------------------------------------------------------------------

        export проц добавьИзменениеВыбора(ДатчикСобытий значение)
        {
            добавьДатчикКоманд(Событие.Тип.СОБ_КОМАНДА_ВКЛАДКА_ВЫД_ИЗМЕНЕНО, ид, значение, this);
        }
        export проц удалиИзменениеВыбора(ДатчикСобытий значение)
        {
            удалиОбработчик(значение, this);
        }

        export проц SelectionChanging_Add(ДатчикСобытий значение)
        {
            добавьДатчикКоманд(Событие.Тип.СОБ_КОМАНДА_ВКЛАДКА_ВЫД_ИЗМЕНЯЕТСЯ, ид, значение, this);
        }
        export проц SelectionChanging_Remove(ДатчикСобытий значение)
        {
            удалиОбработчик(значение, this);
        }
    }

//! \cond VERSION
} // version(__WXMSW__)
//! \endcond
